package edu.variable;

/*
System 클래스를 알아보기 위해서 만들어진 클래스
파일명을 System으로 작성하면 자바 자체에 존재하는 System class를 사용하기 어렵기 때문에
자바 자체에서 개발자들이 만들어 놓은 클래스 명칭은 피해서 작성해주는 것이 좋다.
자바 자체 개발자들이 만들어 놓은 클래스 기능을 활용하지 못한다.
 */

public class SystemEx {
    /*
    public getProperty() {
        // 현재 컴퓨터 운영체제는 어떻게 되는지? ex) window, mac
        // 자바 버전은 어떻게 되는지?
        // 위와 같은 시스템의 여러 정보를 컴퓨터에서 자체적으로 확인하고 출력해서 개발자가 확인할 수 있도록 설정
    }

    public currentTimeMills() {
        // 현재 시간을 정밀하게 측정해서 프로그램의 실행 속도를 계산하거나 기록할 때 사용한다.
    }

    public exit() {
        // 프로그램을 강제로 종료시킬 때 사용하는 메서드 기능 설정
    }

    public void in() {
        // 사용자가 키보드로 입력한 데이터를 컴퓨터 내에 가져올 수 있도록 설정
    }

    public void out() {
        public void print(String 사용자가작성한값) {
            // 사용자가 작성한 값을 출력할 수 있도록 코드 작성
            // 무조건 가로로 출력이 되지만 \n을 작성하면 줄바꿈 가능하도록 설정
        }
        public void println(String 사용자가작성한값) {
            // 사용자가 작성한 값을 출력할 수 있도록 코드 작성
            // 무조건 작성 후 메서드 종료할 때 엔터를 입력한 형태로 출력되도록 설정
        }
        public void printf(String 사용자가작성한값, 데이터변수명, 데이터변수명...) {
            // 사용자가 작성한 값을 출력할 수 있도록 코드 작성
            // %d %f %s %c %b와 같은 표기를 이용해서 +가 아닌 ,로 출력을 구분한다.
            // , 를 이용해서 각 퍼센트의 위치 순서대로 ,를 작성한 변수명들을 대입하도록 설정
        }
    }

    다른 클래스에서 자바 자체 개발자들이 만들어 놓은
        System.out.println("출력");       구문을 사용할 수 있는 이유

    public void Exam1(){
        System.out.println("출력");
    }
    */
}

/*
포트란(1950~1960)
C언어 (1970) 프린트문 업그레이드

System 클래스는 자바가 처음 만들어질 때부터 콘솔에 텍스트를 출력하는 기능
단순히 out을 이용한 출력 기능만 있는게 아니라
시스템을 제어하고 운영체제와 상호작용하는 다양한 기능들을 모아놓은 만능 도구 상자같은 역할의 클래스
 */